while-one/caffeine-hal-ports/src/stm32/stm32f4/cfn_hal_uart_port.c
#if defined(USART1)
/**
 * @brief USART1 Interrupt Handler.
 */
void USART1_IRQHandler(void) // NOLINT(readability-identifier-naming)
{
    port_uart_handle_isr(CFN_HAL_UART_PORT_USART1);
}
#endif

#if defined(USART2)
/**
 * @brief USART2 Interrupt Handler.
 */
void USART2_IRQHandler(void) // NOLINT(readability-identifier-naming)
{
    port_uart_handle_isr(CFN_HAL_UART_PORT_USART2);
}
#endif

#if defined(USART3)
/**
 * @brief USART3 Interrupt Handler.
 */
void USART3_IRQHandler(void) // NOLINT(readability-identifier-naming)
{
    port_uart_handle_isr(CFN_HAL_UART_PORT_USART3);
}
#endif

#if defined(UART4)
/**
 * @brief UART4 Interrupt Handler.
 */
void UART4_IRQHandler(void) // NOLINT(readability-identifier-naming)
{
    port_uart_handle_isr(CFN_HAL_UART_PORT_UART4);
}
#endif

#if defined(UART5)
/**
 * @brief UART5 Interrupt Handler.
 */
void UART5_IRQHandler(void) // NOLINT(readability-identifier-naming)
{
    port_uart_handle_isr(CFN_HAL_UART_PORT_UART5);
}
#endif

#if defined(USART6)
/**
 * @brief USART6 Interrupt Handler.
 */
void USART6_IRQHandler(void) // NOLINT(readability-identifier-naming)
{
    port_uart_handle_isr(CFN_HAL_UART_PORT_USART6);
}
#endif

#endif /* CFN_HAL_PORT_DISABLE_IRQ_UART */

/* UART Specific Functions */

/**
 * @brief Transmits data in blocking polling mode.
 * @param driver Pointer to the UART driver instance.
 * @param data Pointer to the buffer containing data to transmit.
 * @param length Number of bytes to transmit.
 * @param timeout Timeout in milliseconds.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
static cfn_hal_error_code_t
port_uart_tx_polling(cfn_hal_uart_t *driver, const uint8_t *data, size_t length, uint32_t timeout)
{
    uint32_t port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    return cfn_hal_stm32_map_error(
        HAL_UART_Transmit(&port_huarts[port_id], (uint8_t *) data, (uint16_t) length, timeout));
}

/**
 * @brief Receives data in blocking polling mode.
 * @param driver Pointer to the UART driver instance.
 * @param buffer Pointer to the buffer to store received data.
 * @param length Number of bytes to receive.
 * @param timeout Timeout in milliseconds.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
static cfn_hal_error_code_t
port_uart_rx_polling(cfn_hal_uart_t *driver, uint8_t *buffer, size_t length, uint32_t timeout)
{
    if (driver)
    {
        driver->base.flags &= ~CFN_HAL_UART_FLAG_CONTINUOUS_RX;
    }
    uint32_t port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    return cfn_hal_stm32_map_error(HAL_UART_Receive(&port_huarts[port_id], buffer, (uint16_t) length, timeout));
}

/**
 * @brief Receives data until an IDLE line is detected or the buffer is full.
 * @param driver Pointer to the UART driver instance.
 * @param data Pointer to the buffer to store received data.
 * @param max_bytes Maximum number of bytes to receive.
 * @param received_bytes Pointer to store the actual number of bytes received
 * (optional).
 * @param timeout Timeout in milliseconds.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
static cfn_hal_error_code_t
port_uart_rx_to_idle(cfn_hal_uart_t *driver, uint8_t *data, size_t max_bytes, size_t *received_bytes, uint32_t timeout)
{
    CFN_HAL_UNUSED(timeout);
    CFN_HAL_UNUSED(received_bytes);

    if (driver == NULL)
    {
        return CFN_HAL_ERROR_BAD_PARAM;
    }

    driver->base.flags &= ~CFN_HAL_UART_FLAG_CONTINUOUS_RX;
    uint32_t            port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    UART_HandleTypeDef *huart   = &port_huarts[port_id];

    return cfn_hal_stm32_map_error(HAL_UARTEx_ReceiveToIdle_IT(huart, data, (uint16_t) max_bytes));
}

/**
 * @brief Transmits data using interrupts.
 * @param driver Pointer to the UART driver instance.
 * @param data Pointer to the buffer containing data to transmit.
 * @param nbr_of_bytes Number of bytes to transmit.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
static cfn_hal_error_code_t port_uart_tx_irq(cfn_hal_uart_t *driver, const uint8_t *data, size_t nbr_of_bytes)
{
    uint32_t port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    return cfn_hal_stm32_map_error(
        HAL_UART_Transmit_IT(&port_huarts[port_id], (uint8_t *) data, (uint16_t) nbr_of_bytes));
}

/**
 * @brief Aborts an active interrupt-based transmission.
 * @param driver Pointer to the UART driver instance.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
static cfn_hal_error_code_t port_uart_tx_irq_abort(cfn_hal_uart_t *driver)
{
    uint32_t port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    return cfn_hal_stm32_map_error(HAL_UART_AbortTransmit_IT(&port_huarts[port_id]));
}

/**
 * @brief Receives a fixed number of bytes using interrupts.
 * @param driver Pointer to the UART driver instance.
 * @param data Pointer to the buffer to store received data.
 * @param nbr_of_bytes Number of bytes to receive.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
static cfn_hal_error_code_t port_uart_rx_n_irq(cfn_hal_uart_t *driver, uint8_t *data, size_t nbr_of_bytes)
{
    if (driver)
    {
        driver->base.flags &= ~CFN_HAL_UART_FLAG_CONTINUOUS_RX;
    }
    uint32_t port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    return cfn_hal_stm32_map_error(HAL_UART_Receive_IT(&port_huarts[port_id], data, (uint16_t) nbr_of_bytes));
}

/**
 * @brief Enables continuous RX mode using interrupts.
 * @param driver Pointer to the UART driver instance.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
static cfn_hal_error_code_t port_uart_rx_irq(cfn_hal_uart_t *driver)
{
    if (!driver || !driver->phy || !driver->phy->instance)
    {
        return CFN_HAL_ERROR_BAD_PARAM;
    }
    driver->base.flags |= CFN_HAL_UART_FLAG_CONTINUOUS_RX;
    uint32_t port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    __HAL_UART_ENABLE_IT(&port_huarts[port_id], UART_IT_RXNE);
    return CFN_HAL_ERROR_OK;
}

/**
 * @brief Aborts continuous RX mode or an active interrupt-based reception.
 * @param driver Pointer to the UART driver instance.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
static cfn_hal_error_code_t port_uart_rx_irq_abort(cfn_hal_uart_t *driver)
{
    if (driver)
    {
        driver->base.flags &= ~CFN_HAL_UART_FLAG_CONTINUOUS_RX;
    }
    uint32_t port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    __HAL_UART_DISABLE_IT(&port_huarts[port_id], UART_IT_RXNE);
    return cfn_hal_stm32_map_error(HAL_UART_AbortReceive_IT(&port_huarts[port_id]));
}

/**
 * @brief Starts UART data reception using DMA.
 * @param driver Pointer to the UART driver instance.
 * @param data Pointer to the buffer to store received data.
 * @param nbr_of_bytes Number of bytes to receive.
 * @return CFN_HAL_ERROR_NOT_SUPPORTED (Dummy implementation).
 */
static cfn_hal_error_code_t port_uart_rx_dma(cfn_hal_uart_t *driver, uint8_t *data, size_t nbr_of_bytes)
{
    if (driver)
    {
        driver->base.flags &= ~CFN_HAL_UART_FLAG_CONTINUOUS_RX;
    }
    CFN_HAL_UNUSED(driver);
    CFN_HAL_UNUSED(data);
    CFN_HAL_UNUSED(nbr_of_bytes);
    return CFN_HAL_ERROR_NOT_SUPPORTED;
}

/**
 * @brief UART API VMT instance for the STM32F4 port.
 */
static const cfn_hal_uart_api_t UART_API = {
    .base =
        {
            .init = port_base_init,
            .deinit = port_base_deinit,
            .power_state_set = NULL,
            .config_set = port_base_config_set,
            .config_validate = NULL,
            .callback_register = NULL,
            .event_enable = port_base_event_enable,
            .event_disable = port_base_event_disable,
            .event_get = port_base_event_get,
            .error_enable = port_base_error_enable,
            .error_disable = port_base_error_disable,
            .error_get = port_base_error_get,
        },
    .tx_irq = port_uart_tx_irq,
    .tx_irq_abort = port_uart_tx_irq_abort,
    .rx_n_irq = port_uart_rx_n_irq,
    .rx_irq = port_uart_rx_irq,
    .rx_irq_abort = port_uart_rx_irq_abort,
    .tx_polling = port_uart_tx_polling,
    .rx_polling = port_uart_rx_polling,
    .rx_to_idle = port_uart_rx_to_idle,
    .tx_dma = NULL,
    .rx_dma = port_uart_rx_dma};

#endif /* HAL_UART_MODULE_ENABLED */

