while-one/caffeine-hal-ports/src/stm32/stm32f4/cfn_hal_uart_port.c
/* Instantiation ----------------------------------------------------*/

/**
 * @brief Constructs a new UART driver instance.
 * @param driver Pointer to the driver structure to construct.
 * @param config Pointer to the UART configuration.
 * @param phy Pointer to the physical UART mapping.
 * @param clock Pointer to the clock driver instance.
 * @param callback User callback function.
 * @param user_arg User argument for the callback.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
cfn_hal_error_code_t cfn_hal_uart_construct(cfn_hal_uart_t *driver, const cfn_hal_uart_config_t *config, const cfn_hal_uart_phy_t *phy, struct cfn_hal_clock_s *clock, cfn_hal_uart_callback_t callback, void *user_arg)
{
#ifdef HAL_UART_MODULE_ENABLED
    if ((driver == NULL) || (phy == NULL))
    {
        return CFN_HAL_ERROR_BAD_PARAM;
    }
    uint32_t port_id = (uint32_t) (uintptr_t) phy->instance;
    if (port_id >= CFN_HAL_UART_PORT_MAX)
    {
        return CFN_HAL_ERROR_BAD_PARAM;
    }

    if (PORT_INSTANCES[port_id] == NULL)
    {
        return CFN_HAL_ERROR_BAD_PARAM;
    }

    uint32_t peripheral_id = PORT_MAP_PERIPHERAL_ID[port_id];

    cfn_hal_uart_populate(driver, peripheral_id, clock, &UART_API, phy, config, callback, user_arg);

    port_huarts[port_id].Instance = PORT_INSTANCES[port_id];
    port_drivers[port_id]         = driver;

    return CFN_HAL_ERROR_OK;
#else
    CFN_HAL_UNUSED(port_id);
    CFN_HAL_UNUSED(driver);
    CFN_HAL_UNUSED(config);
    CFN_HAL_UNUSED(phy);
    CFN_HAL_UNUSED(clock);
    CFN_HAL_UNUSED(callback);
    CFN_HAL_UNUSED(user_arg);
    return CFN_HAL_ERROR_NOT_SUPPORTED;
#endif
}

/**
 * @brief Destructs an existing UART driver instance.
 * @param driver Pointer to the driver instance to destruct.
 * @return CFN_HAL_ERROR_OK on success, or a specific error code on failure.
 */
cfn_hal_error_code_t cfn_hal_uart_destruct(cfn_hal_uart_t *driver)
{
#ifdef HAL_UART_MODULE_ENABLED
    if (driver == NULL || driver->phy == NULL)
    {
        return CFN_HAL_ERROR_BAD_PARAM;
    }

    uint32_t port_id = (uint32_t) (uintptr_t) driver->phy->instance;
    if (port_id < CFN_HAL_UART_PORT_MAX)
    {
        port_drivers[port_id] = NULL;
    }

    driver->config = NULL;
    driver->phy    = NULL;
    return CFN_HAL_ERROR_OK;
#else
    CFN_HAL_UNUSED(driver);
    return CFN_HAL_ERROR_NOT_SUPPORTED;
#endif
}
